# DataFrame

In [2]:
import pandas as pd

In [3]:
d=pd.DataFrame()

In [4]:
d

Empty DataFrame
Columns: []
Index: []

In [5]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [6]:
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [7]:
data=[['Alex',1],['Bob',2],['John',3],['Harry',4]]

In [8]:
data

[['Alex', 1], ['Bob', 2], ['John', 3], ['Harry', 4]]

In [9]:
d=pd.DataFrame(data)

In [10]:
d

       0  1
0   Alex  1
1    Bob  2
2   John  3
3  Harry  4

In [11]:
d=pd.DataFrame(data,columns=['Name','Age'],index=['A','B','C','D'])
d

    Name  Age
A   Alex    1
B    Bob    2
C   John    3
D  Harry    4

In [12]:
#DataFrame using dictionary
data1={"Name":['Riya','Ayushi','Sam','Divya'],"Marks":[77,89,90,56]}

In [13]:
d1=pd.DataFrame(data1)

In [14]:
d1

     Name  Marks
0    Riya     77
1  Ayushi     89
2     Sam     90
3   Divya     56

In [19]:
d1.rename({"Name":"Candidates"},axis=1,inplace=True)

In [20]:
d1

  Candidates  Marks
0       Riya     77
1     Ayushi     89
2        Sam     90
3      Divya     56

In [21]:
# Accesing the elemnts from dataFrame
data=[['Alex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [22]:
data

[['Alex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [23]:
data[4][1]

18

In [24]:
data[3][2]

'Geo'

In [25]:
data[1][0]

'Bob'

In [28]:
data[1][1]

12

In [29]:
import pandas as pd

In [32]:
d=pd.DataFrame(data,columns=['Candidate','Marks','Subject'])

In [33]:
d

  Candidate  Marks  Subject
0      Alex     10    Maths
1       Bob     12  Science
2     Kelly     15      Eco
3     Boris     14      Geo
4       Ken     18  English

In [37]:
d.Candidate

0     Alex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Candidate, dtype: object

In [38]:
d['Candidate']

0     Alex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Candidate, dtype: object

In [40]:
d[['Candidate','Subject']]

  Candidate  Subject
0      Alex    Maths
1       Bob  Science
2     Kelly      Eco
3     Boris      Geo
4       Ken  English

In [43]:
d.iloc[1,0]

'Bob'

In [44]:
d.iloc[1,0]='Kim'

In [45]:
d

  Candidate  Marks  Subject
0      Alex     10    Maths
1       Kim     12  Science
2     Kelly     15      Eco
3     Boris     14      Geo
4       Ken     18  English

In [47]:
d['Gender']='Male'
d

  Candidate  Marks  Subject Gender
0      Alex     10    Maths   Male
1       Kim     12  Science   Male
2     Kelly     15      Eco   Male
3     Boris     14      Geo   Male
4       Ken     18  English   Male

In [48]:
d['Marks']=d['Marks']+1

In [49]:
d

  Candidate  Marks  Subject Gender
0      Alex     11    Maths   Male
1       Kim     13  Science   Male
2     Kelly     16      Eco   Male
3     Boris     15      Geo   Male
4       Ken     19  English   Male

In [53]:
d.iloc[:,[0,1]]

  Candidate  Marks
0      Alex     11
1       Kim     13
2     Kelly     16
3     Boris     15
4       Ken     19

In [58]:
d.iloc[[4,1],[0,2]]

  Candidate  Subject
4       Ken  English
1       Kim  Science

In [60]:
d.iloc[1:4,[0,2]]

  Candidate  Subject
1       Kim  Science
2     Kelly      Eco
3     Boris      Geo

In [62]:
d.iloc[3]

Candidate    Boris
Marks           15
Subject        Geo
Gender        Male
Name: 3, dtype: object

In [93]:
d.loc[:3],['Candidate','Marks']

(  Candidate Marks  Subject Gender
 0    Jayesh    11    Maths   Male
 1       Gav    13  Science   Male
 2       Ram    16      Eco   Male
 3     Boris    15      Geo   Male,
 ['Candidate', 'Marks'])

In [71]:
d

  Candidate  Marks  Subject Gender
0      Alex     11    Maths   Male
1       Kim     13  Science   Male
2     Kelly     16      Eco   Male
3     Boris     15      Geo   Male
4       Ken     19  English   Male

In [90]:
d.iloc[:3,1]=["11","13","16"]

In [91]:
d

  Candidate Marks  Subject Gender
0    Jayesh    11    Maths   Male
1       Gav    13  Science   Male
2       Ram    16      Eco   Male
3     Boris    15      Geo   Male
4       Ken    19  English   Male

In [96]:
d["Marks"]

0    11
1    13
2    16
3    15
4    19
Name: Marks, dtype: object

In [100]:
d.loc[:,"Marks"]

0    11
1    13
2    16
3    15
4    19
Name: Marks, dtype: object

In [102]:
d.iloc[:,[1]]

  Marks
0    11
1    13
2    16
3    15
4    19

In [103]:
d.iloc[:1:-1]

  Candidate Marks  Subject Gender
4       Ken    19  English   Male
3     Boris    15      Geo   Male
2       Ram    16      Eco   Male

In [104]:
d.iloc[:3,1:3]

  Marks  Subject
0    11    Maths
1    13  Science
2    16      Eco

In [106]:
d.iloc[3:1:-1]

  Candidate Marks Subject Gender
3     Boris    15     Geo   Male
2       Ram    16     Eco   Male

In [107]:
d.iloc[::-1]

  Candidate Marks  Subject Gender
4       Ken    19  English   Male
3     Boris    15      Geo   Male
2       Ram    16      Eco   Male
1       Gav    13  Science   Male
0    Jayesh    11    Maths   Male

In [108]:
d.loc[::-1]

  Candidate Marks  Subject Gender
4       Ken    19  English   Male
3     Boris    15      Geo   Male
2       Ram    16      Eco   Male
1       Gav    13  Science   Male
0    Jayesh    11    Maths   Male

In [112]:
d.iloc[:,[3,2,1,0]]

  Gender  Subject Marks Candidate
0   Male    Maths    11    Jayesh
1   Male  Science    13       Gav
2   Male      Eco    16       Ram
3   Male      Geo    15     Boris
4   Male  English    19       Ken